# MEPNetworkIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPNetworkIterator Properties
MEPNetworkIterator Class See Also
---
The MEPNetworkIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentElementId | The element id at the current iteration step. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SystemClassification | The optional MEP system classification where the iterations are restricted. |
| SystemId | The optional MEP system element id where the iterations are restricted. |

# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace